In [7]:
import numpy as np
import pandas as pd

In [18]:
df = pd.DataFrame([[1.4,np.NAN],[7.1,-4.5],
                 [np.nan,np.nan],[0.75,-1.3]],
                 index = ['a','b','c','d'],
                 columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [30]:
df.sum()  #默认是按行求和
df.sum(axis=1,skipna=False) #按列求和 skipna=False  NAN不被当0看待
df.sum(axis=1,skipna=True) #按列求和  skipna=True  NAN被当0看待
df.idxmax() #返回最大值的行索引
df.describe()#汇总

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000